import pandas as pd
import os
import openpyxl

file_path = os.path.join("..", "data", "operations.xlsx")


def get_transactions_excel(transactions_file):
    """Получение файла транзакций в формате excel и перевод в список словарей."""

    read_file_excel = pd.read_excel(transactions_file)
    file_no_nan = read_file_excel.where(pd.notna(read_file_excel), "")
    exel_file_to_dict = file_no_nan.to_dict("records")
    return exel_file_to_dict


# result = get_transactions_excel(file_path)
# print(result)


{
    "Дата операции": "01.01.2018 12:49:53",
    "Дата платежа": "01.01.2018",
    "Номер карты": "",
    "Статус": "OK",
    "Сумма операции": -3000.0,
    "Валюта операции": "RUB",
    "Сумма платежа": -3000.0,
    "Валюта платежа": "RUB",
    "Кэшбэк": "",
    "Категория": "Переводы",
    "MCC": "",
    "Описание": "Линзомат ТЦ Юность",
    "Бонусы (включая кэшбэк)": 0,
    "Округление на инвесткопилку": 0,
    "Сумма операции с округлением": 3000.0,
}

{
    "Дата операции": "10.01.2018 12:59:23",
    "Дата платежа": "10.01.2018",
    "Номер карты": "",
    "Статус": "OK",
    "Сумма операции": 30000.0,
    "Валюта операции": "RUB",
    "Сумма платежа": 30000.0,
    "Валюта платежа": "RUB",
    "Кэшбэк": "",
    "Категория": "Пополнения",
    "MCC": 6012.0,
    "Описание": "Перевод с карты",
    "Бонусы (включая кэшбэк)": 0,
    "Округление на инвесткопилку": 0,
    "Сумма операции с округлением": 30000.0,
}
