import os
from datetime import datetime

from src.read_excel_file import file_path, get_transactions_excel

#
# def get_time():
#     """Принимает время на момент использования и
#     в зависимости от времени приветствует пользователя."""
#
#     datetime_now = datetime.now()
#     data_str = datetime_now.strftime('%Y-%m-%d %H:%M:%S')
#     return data_str
#
# # # Тестирование функций, не обязательная переменная.
# # result = get_time()
# # # print(result)
#
# def greeting(date: str) -> str:
#     """Приветствие в зависимости от времени обращения."""
#
#     if 5 <= int(date[11:13]) <= 11:
#         return f'Доброе утро!'
#     elif 12 <= int(date[11:13]) <= 15:
#         return f'Добрый день!'
#     elif 16 <= int(date[11:13]) <= 21:
#         return f'Добрый вечер!'
#     else:
#         return f'Доброй ночи!'
#
# # result = greeting(get_time())
# # print(result)
#
#
# def mask_card(number_card: str) -> str:
#     """На вход передается строка с номером карты,
#     после чего происходит маскировка"""
#
#     pass

if __name__ == '__main__':

    transactions_1 = [{
        "Дата операции": "01.01.2018 12:49:53",
        "Дата платежа": "01.01.2018",
        "Номер карты": "",
        "Статус": "OK",
        "Сумма операции": -3000.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -3000.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": "",
        "Категория": "Переводы",
        "MCC": "",
        "Описание": "Линзомат ТЦ Юность",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 3000.0,
    },
    {
        "Дата операции": "10.01.2018 12:59:23",
        "Дата платежа": "10.01.2018",
        "Номер карты": "",
        "Статус": "OK",
        "Сумма операции": 30000.0,
        "Валюта операции": "RUB",
        "Сумма платежа": 30000.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": "",
        "Категория": "Пополнения",
        "MCC": 6012.0,
        "Описание": "Перевод с карты",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 30000.0,
    }]



    # file_path = os.path.join('vievs', 'result')

    def total_expenses(transactions: list[dict]) -> list:
        """Получает список словарей с транзакциями
        и возвращает объединенную сумму расходов или доходов в зависимости от данных."""

        # Список расходов и поступлений.
        return sum([t['Сумма операции'] for t in transactions])


    result = get_transactions_excel(file_path)
    print(total_expenses(result))